app/views/instructors/create_event.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :presenter_ids, "Select Presenter(s)" %><br>
    <%= f.collection_select :presenter_ids, User.all, :id, :email, { prompt: "Choose presenter(s)" }, { multiple: true, size: 5 } %>