app/controllers/instructors_controller.rb

SELECT "events".* FROM "events"
---
  def dashboard
    @events = Event.all

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."event_id" = ?  [["event_id", 14]]
SELECT "event_presenters".* FROM "event_presenters" WHERE "event_presenters"."event_id" = ?  [["event_id", 30]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 7], ["id", 6]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def all_eval
    @event = Event.find(params[:event_id])
    @evaluations = Evaluation.where(event_id: @event.id).includes(:student)
    @presenters = @event.event_presenters.includes(:user)

SELECT "events".* FROM "events"
SELECT "users".* FROM "users" WHERE "users"."admin" = ?  [["admin", 0]]
---
  def new_evaluation
    @evaluation = Evaluation.new
    @events = Event.all
    @students = User.where(admin: false)

SELECT "event_presenters".* FROM "event_presenters" WHERE "event_presenters"."id" = ? LIMIT ?  [["id", 70], ["LIMIT", 1]]
UPDATE "event_presenters" SET "grade" = ? WHERE "event_presenters"."id" = ?  [["grade", "A"], ["id", 70]]
---
  def update_grade
    ep = EventPresenter.find(params[:id])
    if ep.update(grade: params[:grade])

INSERT INTO "events" ("title", "description", "date", "created_at", "updated_at", "presenter_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", ""], ["description", ""], ["date", nil], ["created_at", "2025-04-17 17:28:50.588910"], ["updated_at", "2025-04-17 17:28:50.588910"], ["presenter_id", nil]]
---
  def events
    if request.post?
      @event = Event.new(params.require(:event).permit(:title, :date, :description, presenter_ids: []))
      if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 11]]
DELETE FROM "event_presenters" WHERE "event_presenters"."event_id" = ? AND 1=0  [["event_id", 23]]
DELETE FROM "event_presenters" WHERE "event_presenters"."event_id" = ? AND 1=0  [["event_id", 11]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 15]]
---
def destroy_event
  @event = Event.find(params[:id])

  @event.presenters.clear
  @event.destroy

SELECT "users".* FROM "users" WHERE "users"."admin" = ?  [["admin", 0]]
---
def roster
  @students = User.where(admin: false)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "grade" = ? WHERE "users"."id" = ?  [["updated_at", "2025-04-22 16:24:53.157524"], ["grade", "--"], ["id", 3]]
---
def save_grades
  params[:grades]&.each do |_, grade_data|
    student_id = grade_data[:student_id]
    grade = grade_data[:grade]

    student = User.find_by(id: student_id)
    next unless student

    student.update(grade: grade)