app/controllers/students_controller.rb

SELECT "evaluations"."event_id" FROM "evaluations" WHERE "evaluations"."student_id" = ?  [["student_id", 6]]
SELECT "events".* FROM "events" WHERE 1=1
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."student_id" != ?  [["student_id", 3]]
---
  def dashboard
    evaluated_event_ids = current_user.evaluations.pluck(:event_id)
    @events = Event.where.not(id: evaluated_event_ids + current_user.presented_events.pluck(:id))
    @presented_events = current_user.presented_events
    @feedbacks = Feedback.where.not(student_id: current_user.id)

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."event_id" = ? AND "evaluations"."student_id" != ?  [["event_id", 11], ["student_id", 3]]
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."student_id" != ?  [["student_id", 3]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "event_presenters".* FROM "event_presenters" WHERE "event_presenters"."event_id" = ? AND "event_presenters"."user_id" = ? LIMIT ?  [["event_id", 31], ["user_id", 6], ["LIMIT", 1]]
---
  def presenter_feed
    @event = Event.find(params[:event_id])
    @feedbacks = Feedback.where(event_id: @event.id).where.not(student_id: current_user.id)
    @evaluations = @event.evaluations.includes(:student).where.not(student_id: current_user.id)

    presenter_link = @event.event_presenters.find_by(user_id: current_user.id)

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def eval_form
    @event = Event.find(params[:event_id])

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
INSERT INTO "evaluations" ("event_id", "student_id", "clarity", "organization", "technical", "comments", "created_at", "updated_at", "presenter_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create_evaluation
    @event = Event.find(evaluation_params[:event_id])
    @evaluation = @event.evaluations.build(evaluation_params)
    @evaluation.student = current_user

    # Debug logging
    Rails.logger.debug "Event: #{@event.inspect}"
    Rails.logger.debug "Evaluation: #{@evaluation.inspect}"

    if @evaluation.save